Programação Web/docker-code/www/codeigniter4/app/Controllers/Admin/Client.php

    public function listClients()
    {
        $session = \Config\Services::session();
        if ($session->has('user')) {
            $ClientModel = new ClientModel;
            $data = [
                'clients' => $ClientModel->findAll(),
            ];
---
SELECT *
FROM `clients`

    public function insertClientAction()
    {
        $ClientModel = new ClientModel;
        $data = [
            'name' => $this->request->getVar('name'),
            'email' => $this->request->getVar('email'),
            'phone' => $this->request->getVar('phone'),
            'address' => $this->request->getVar('address')
        ];
        $ClientModel->insert($data);
---
INSERT INTO `clients` (`name`, `email`, `phone`, `address`) VALUES ('alterado', '123@hotmail.com', '123456', 'rua da ponta')

    public function updateClient($idClient)
    {
        $session = \Config\Services::session();
        if ($session->has('user')) {
            $ClientModel = new ClientModel;
            $data = [
                'client' => $ClientModel->find($idClient),
            ];
---
SELECT *
FROM `clients`
WHERE `clients`.`idClient` = '15'

    public function deleteClient($idClient)
    {
        $ClientModel = new ClientModel;
        $ClientModel->delete($idClient);
---
DELETE FROM `clients`
WHERE `idClient` IN ('15')

    public function clients(){
        $ClientModel = new ClientModel;
        $data = [
            'clients' => $ClientModel->findAll(),
        ];
---
SELECT *
FROM `clients`